{
  "en": {
    "Apostles' Creed": {
      "text": "I believe in God, the Father Almighty, Creator of heaven and earth; and in Jesus Christ, His only Son, our Lord, who was conceived by the Holy Spirit, born of the Virgin Mary, suffered under Pontius Pilate, was crucified, died, and was buried. He descended into hell; on the third day He rose again from the dead; He ascended into heaven, and is seated at the right hand of God the Father Almighty; from there He will come to judge the living and the dead. I believe in the Holy Spirit, the holy Catholic Church, the communion of saints, the forgiveness of sins, the resurrection of the body, and life everlasting. Amen.",
  "explanation": "This prayer is a profession of faith, affirming belief in God the Father, Jesus Christ, the Holy Spirit, and the core truths of the Christian faith."
    },
    "Our Father": {
      "text": "Our Father, who art in heaven, hallowed be Thy name; Thy kingdom come; Thy will be done on earth as it is in heaven. Give us this day our daily bread; and forgive us our trespasses, as we forgive those who trespass against us; and lead us not into temptation, but deliver us from evil. Amen.",
      "explanation": "This prayer teaches us to recognise God's holiness, seek His will, rely on Him for daily needs, and practice forgiveness."
    },
    "Hail Mary": {
      "text": "Hail Mary, full of grace, the Lord is with thee; blessed art thou among women, and blessed is the fruit of thy womb, Jesus. Holy Mary, Mother of God, pray for us sinners, now and at the hour of our death. Amen.",
      "explanation": "This prayer honors Mary and seeks her intercession, reminding us to ask for guidance and spiritual support."
    },
    "Glory Be": {
      "text": "Glory be to the Father, and to the Son, and to the Holy Spirit. As it was in the beginning, is now, and ever shall be, world without end. Amen.",
      "explanation": "It praises the Holy Trinity, reminding us to honor God throughout all time and in all things."
    },
    "Saint Francis Prayer": {
      "text": "Lord, make me an instrument of your peace. Where there is hatred, let me sow love; where there is injury, pardon; where there is doubt, faith; where there is despair, hope; where there is darkness, light; and where there is sadness, joy. O Divine Master, grant that I may not so much seek to be consoled as to console; to be understood as to understand; to be loved as to love. For it is in giving that we receive, it is in pardoning that we are pardoned, and it is in dying that we are born to eternal life. Amen.",
      "explanation": "This prayer focuses on becoming a channel of God's peace, emphasising selflessness, forgiveness, and spreading love and hope."
    },
    "Act of Contrition": {
      "text": "O my God, I am heartily sorry for having offended You, and I detest all my sins because I dread the loss of heaven and the pains of hell, but most of all because they offend You, my God, who are all-good and deserving of all my love. I firmly resolve, with the help of Your grace, to confess my sins, to do penance, and to amend my life. Amen.",
      "explanation": "This prayer teaches sincere repentance, expressing sorrow for sins and a firm resolution to improve."
    },
    "Prayer Before Meals": {
      "text": "Bless us, O Lord, and these Thy gifts, which we are about to receive from Thy bounty, through Christ our Lord. Amen.",
      "explanation": "It reminds us to give thanks for our food and recognise God’s providence in our daily sustenance."
    },
    "Guardian Angel Prayer": {
      "text": "Angel of God, my guardian dear, to whom God’s love commits me here, ever this day be at my side, to light and guard, to rule and guide. Amen.",
      "explanation": "This prayer seeks protection and guidance from our guardian angels, reminding us of God’s care in our daily lives."
    },
    "God gives me strength": {
      "text": "God, thank You for providing for my every need. At all times, You are my source of strength, hope, and peace, and You have blessed me abundantly. Today, please help me to recognize Your blessings, and share them with others. Help me to love and care for others as You have loved and cared for me. In Jesus' name, Amen.",
  "explanation": "This prayer expresses gratitude for God's strength and blessings, asking for help to share His love and care with others."
    },
    "Another beautiful sunrise": {
      "text": "Dear Lord, Thank you so much for another day of life on Earth. Thank you for another beautiful sunrise to enjoy. Thank you for the wonderful sounds of nature, from the cool breeze brushing through the trees to the birds singing melodies. You are a wonderful God, full of grace and mercy. I praise you for allowing me another day to spend with my family. I love you Father! Amen.",
  "explanation": "This prayer thanks God for the gift of life, the beauty of creation, and the blessing of family, filling the heart with gratitude and praise."
    },
    "Morning Prayer of St. Francis": {
      "text": "Lord, help me to live this day, quietly, easily; To lean upon Thy great strength, trustfully, restfully; To wait for the unfolding of Thy will, patiently, serenely; To meet others, peacefully, joyously; To face tomorrow, confidently, courageously. Amen.",
  "explanation": "This prayer asks God for the grace to live each day with peace, trust, patience, and courage, reflecting His love in all we do."
    },
    "Karakia": {
      "text": "E te Atua, whakapaingia ēnei kai. Hei oranga mō ō matou tinana. Āmine. Thank you God for giving us food. Amen.",
  "explanation": "This prayer thanks God for the gift of food and asks for His blessing that it may nourish and sustain us."
    }
  },
  "vi": {
    "Our Father": {
      "text": "Lạy Cha chúng con ở trên Trời chúng con nguyện danh Cha cả sáng, nước Cha trị đến, ý cha thể hiện dưới đất cũng như trên trời. Xin Cha cho chúng con hôm nay lương thực hằng ngày, và tha nợ chúng con, như chúng con cũng tha kẻ có nợ chúng con, xin chớ để chúng con sa chước cám dỗ, nhưng cứu chúng con cho khỏi sự dữ. Amen.",
      "explanation": "Cầu nguyện này nhắc nhở chúng ta tôn thờ Chúa, xin ý Ngài thực hiện, tin tưởng Ngài cung cấp nhu cầu hàng ngày và thực hành tha thứ."
    },
    "Hail Mary": {
      "text": "Kính mừng Maria đầy ơn phước, Ðức Chúa Trời ở cùng Bà, Bà có phúc lạ, hơn mọi người Nữ, và Giêsu con lòng Bà gồm phúc lạ. Thánh Maria Ðức Mẹ Chúa Trời cầu cho chúng con là kẻ có tội, khi này và trong giờ lâm tử. Amen.",
      "explanation": "Kinh này tôn vinh Mẹ Maria và xin Mẹ chuyển cầu, nhắc nhở chúng ta cầu xin hướng dẫn và sự nâng đỡ thiêng liêng."
    },
    "Glory Be": {
      "text": "Sáng danh Ðức Chúa Cha và Ðức Chúa Con và Ðức Chúa Thánh Thần, như đã có trước vô cùng và bây giờ và hằng có và đời đời chẳng cùng. Amen.",
      "explanation": "Kinh này tôn vinh Ba Ngôi, nhắc nhở chúng ta kính trọng Chúa trong mọi thời gian và mọi việc."
    },
    "Saint Francis Prayer": {
      "text": "Lạy Chúa, xin cho con trở nên khí cụ bình an của Chúa. Nơi có hận thù, xin cho con gieo tình yêu; nơi có thương tổn, xin cho con gieo sự tha thứ; nơi có nghi ngờ, xin cho con gieo đức tin; nơi có tuyệt vọng, xin cho con gieo hy vọng; nơi có bóng tối, xin cho con gieo ánh sáng; nơi có buồn bã, xin cho con gieo niềm vui. Lạy Thầy Thiêng Liêng, xin cho con không tìm kiếm được an ủi nhưng để an ủi; không tìm kiếm được hiểu nhưng để hiểu; không tìm kiếm được yêu nhưng để yêu. Vì trong việc cho đi mà ta nhận được, trong việc tha thứ mà ta được tha, và trong việc chết đi mà ta được sinh ra đời sống vĩnh cửu. Amen.",
      "explanation": "Kinh này nhấn mạnh trở thành kênh truyền bình an của Chúa, chú trọng sự vị tha, tha thứ và gieo yêu thương, hy vọng."
    },
    "Act of Contrition": {
      "text": "Lạy Chúa, con thật lòng ăn năn vì đã xúc phạm đến Chúa, và con ghét tất cả tội lỗi của mình, nhất là vì chúng xúc phạm đến Chúa, Đấng toàn thiện và đáng yêu mến. Con quyết tâm, nhờ ơn Chúa giúp, xưng tội, làm đền tội và sửa đổi đời sống. Amen.",
      "explanation": "Kinh này dạy sự hối lỗi chân thành, thể hiện nỗi ân hận về tội lỗi và quyết tâm sửa đổi."
    },
    "Prayer Before Meals": {
      "text": "Lạy Chúa, xin chúc lành cho chúng con và các thực phẩm mà chúng con sắp dùng, nhờ Chúa Kitô, Chúa chúng con. Amen.",
      "explanation": "Nhắc nhở chúng ta tạ ơn Chúa về lương thực và nhận ra sự quan phòng của Ngài trong cuộc sống hàng ngày."
    },
    "Guardian Angel Prayer": {
      "text": "Thiên thần của Chúa, người bảo vệ con, mà Chúa giao cho con, xin luôn ở bên con hôm nay, soi sáng, bảo vệ, hướng dẫn và dẫn dắt con. Amen.",
      "explanation": "Kinh này xin các thiên thần hộ mệnh bảo vệ và hướng dẫn, nhắc nhở chúng ta về sự quan tâm của Chúa trong đời sống hàng ngày."
    }
  },
  "tl": {
    "Our Father": {
      "text": "Ama Namin, sumasalangit Ka, sambahin ang ngalan Mo. Mapasaamin ang kaharian Mo. Sundin ang loob Mo, dito sa lupa para nang sa langit. Bigyan Mo kami ngayon ng aming kakanin sa araw-araw. At patawarin Mo kami sa aming mga sala, para nang pagpapatawad namin sa mga nagkakasala sa amin. At huwag Mo kaming ipahintulot sa tukso, at iligtas Mo kami sa masama. Amen.",
      "explanation": "Itinuturo ng panalangin na ito ang paggalang sa Diyos, pagsunod sa Kanyang kalooban, at pag-asa sa Kanya para sa pang-araw-araw na pangangailangan at kapatawaran."
    },
    "Hail Mary": {
      "text": "Aba Ginoong Maria, napupuno ka ng grasya, ang Panginoon ay sumasaiyo; pinagpala ka sa babaeng lahat at pinagpala ang iyong anak na si Hesus. Santa Maria, Ina ng Diyos, ipanalangin mo kami, mga makasalanan, ngayon at kung kami'y mamamatay. Amen.",
      "explanation": "Ipinapakita nito ang paggalang kay Maria at humihiling ng kanyang panalangin, na nagpapaalala sa atin na humingi ng gabay at espiritwal na suporta."
    },
    "Glory Be": {
      "text": "Luwalhatiin ang Ama, ang Anak, at ang Espiritu Santo. Kung noon, ngayon, at magpakailanman. Amen.",
      "explanation": "Pinupuri nito ang Banal na Trinidad at nagpapaalala sa atin na parangalan ang Diyos sa lahat ng panahon at bagay."
    },
    "Saint Francis Prayer": {
      "text": "Panginoon, gawin Mo akong instrumento ng Iyong kapayapaan. Kung saan may galit, doon ko ihabog ang pag-ibig; kung saan may sugat, doon ko ipatawad; kung saan may pagdududa, doon ko itanim ang pananampalataya; kung saan may kawalan ng pag-asa, doon ko ilagay ang pag-asa; kung saan may kadiliman, doon ko dalhin ang liwanag; at kung saan may kalungkutan, doon ko ibigay ang kagalakan. Banal na Guro, huwag Mo sanang hayaang hanapin ko ang aking sariling konsolasyon, kundi ang konsolasyon ng iba; ang pagkaunawa, hindi upang ako ay maintindihan, kundi upang maintindihan ang iba; ang pag-ibig, hindi upang ako ay mahalin, kundi upang mahalin ang iba. Sapagkat sa pagbibigay ay natatanggap, sa pagpapatawad ay napapatawad, at sa pag-aalay ng buhay ay nagkakaroon ng buhay na walang hanggan. Amen.",
      "explanation": "Panalangin na ito ay nakatuon sa pagiging daluyan ng kapayapaan ng Diyos, binibigyang-diin ang pagiging walang pag-iimbot, pagpapatawad, at pagpapalaganap ng pag-ibig at pag-asa."
    },
    "Act of Contrition": {
      "text": "O Diyos ko, taos-puso akong nagsisisi sa aking mga kasalanan, at itinakwil ko ang mga ito sapagkat nasasaktan Ko ang Iyo, Diyos ko na lubos na mabuti at karapat-dapat sa aking pagmamahal. Nang may tulong ng Iyong biyaya, buong puso akong nagsisikap na itama ang aking buhay at magsisi sa aking mga kasalanan. Amen.",
      "explanation": "Tinuturo ng panalangin na ito ang taos-pusong pagsisisi at determinasyon na iwasto ang buhay at magsisi sa mga kasalanan."
    },
    "Prayer Before Meals": {
      "text": "Pagpalain Mo, O Panginoon, kami at ang pagkaing ito na aming tatanggapin, sa pamamagitan ni Kristo, aming Panginoon. Amen.",
      "explanation": "Nagpapakita ito ng pasasalamat para sa pagkain at pagkilala sa pagkakaloob ng Diyos sa araw-araw."
    },
    "Guardian Angel Prayer": {
      "text": "Anghel ng Diyos, mahal kong tagapag-alaga, na ipinagkaloob sa akin ng Diyos, manatili ka sa aking tabi ngayon at magpakailanman, upang gabayan, pangalagaan at ituro ako. Amen.",
      "explanation": "Panalangin para sa proteksyon at paggabay ng ating mga guardian angel, nagpapaalala ng pangangalaga ng Diyos sa ating buhay."
    }
  }
}

